Repository: Agasper/GamePatcher
Catalog: Patcher/Properties/Strings.*.resx
Languages: ru_ru

# adding_file
source: Extracting {0}
ru_ru: Распаковка {0}

# cant_get_current_version
source: Can't verify current version of files. Please reinstall game.
ru_ru: Не могу определить текущую версию файлов. Пожалуйста переустановите игру.

# cant_get_new_version
source: Can't retrieve last version of files. It's possible that the server have a technical issues. If this error persists over a long period of time please contact the support of the game.
ru_ru: Не удается получить информацию о последней версии игры. Возможно у вас проблемы в подключением к интернету или на сервере проходят технические работы. Если эта ошибка сохраняется на протяжении долгого времени обратитесь в службу поддержки игры.

# cant_get_patch
source: Can't download a update. Try to repeat attempt later.
ru_ru: Не удается скачать обновление. Попробуйте повторить попытку позднее.

# cant_load_configuration
source: Can't load configuration file: {0}
ru_ru: Невозможно загрузить файл настроек: {0}

# checking_file
source: Checking {0}
ru_ru: Проверка {0}

# checking_new_version
source: Checking for new updates...
ru_ru: Проверка наличия обновлений...

# checking_version
source: Checking current version...
ru_ru: Проверка текущей версии...

# copying_file
source: Copying {0}
ru_ru: Копирование {0}

# deleting_file
source: Deleting {0}
ru_ru: Удаление {0}

# exit_confirmation
source: Update in progress. Are you sure to want to quit ?
ru_ru: Идет обновление игры. Вы действительно хотите выйти ?

source: Initialization...
ru_ru: Инициализация...

# invalid_patch
source: Patching a file {0} was interrupted. Can't apply patch because file was changed. Check your computer for viruses or reinstall game client.
ru_ru: Обновление файла {0} было прервано, т.к. он был изменен. Проверьте ваш компьютер на вирусы или переустановите клиент игры.

# invalid_target_directory
source: Directory not exists: {0}
ru_ru: Указанная директория не существует: {0}

source: Launcher
ru_ru: Загрузчик

source: Loading news...
ru_ru: Загрузка новостей игры...

# patching_file
source: Updating {0}
ru_ru: Обновление {0}

# patch_broke_client
source: Patching a file {0} was interrupted. Can't apply patch because patched file is broken. Check your computer for viruses or reinstall game client.
ru_ru: Обновление файла {0} было прервано, т.к. он не прошел проверку на целостность. Проверьте ваш компьютер на вирусы или переустановите клиент игры.

# run_without_target_directory
source: You run patcher in debug mode. Patcher can't patch itself in this mode and exceptions may occur. Continue ?
ru_ru: Вы запустили патчер в режиме отладки. Патчер не сможет патчить себя в этом режиме, а если попытается это сделать, то произойдет ошибка. Продолжить ?

# start_downloading
source: Preparing download...
ru_ru: Начало загрузки...

# unknown_exception
source: Unexpected error occurred in progress of applying patch. We are very much apologize for it. If you even approximately't know why it has happened, then please make a screenshot and show it to the support service Message: {0} Stack: {1}
ru_ru: При обновлении клиента игры возникла непредвиденная ошибка, за которую мы очень сильно извиняемся. Если Вы даже примерно не догадываетесь почему она произошла, то сделайте пожалуйста скриншот и покажите его службе поддержки Message: {0} Stack: {1}

# unpacking_patch_info
source: Preparing to patch...
ru_ru: Подготовка к обновлению...

# update_done
source: Done!
ru_ru: Обновление завершено

# update_error
source: Cancelled
ru_ru: Обновление прервано
